In [2]:
import numpy as np
import pandas as pd
import matplotlib as plt

#### Checking and Cleaning NULL/NaN Values

In [4]:
s=pd.DataFrame({'Name':['Karthik','Omkar','Piyush','Sid','Ajay'],'Department':['UIM',np.nan ,'Helpdesk','Spectrum',np.nan],'Salary':[np.nan,18000,np.nan,60000,80000]})

In [5]:
s

      Name Department   Salary
0  Karthik        UIM      NaN
1    Omkar        NaN  18000.0
2   Piyush   Helpdesk      NaN
3      Sid   Spectrum  60000.0
4     Ajay        NaN  80000.0

In [16]:
#Displays a boolean value to check the column having null values

s[['Department','Salary']].isna()

   Department  Salary
0       False    True
1        True   False
2       False    True
3       False   False
4        True   False

In [11]:
#Returns all the rows with Salary having Null values

s[s['Salary'].isnull()]

      Name Department  Salary
0  Karthik        UIM     NaN
2   Piyush   Helpdesk     NaN

In [12]:
#Returns all the rows with Salary not having Null values

s[s['Salary'].notnull()]

    Name Department   Salary
1  Omkar        NaN  18000.0
3    Sid   Spectrum  60000.0
4   Ajay        NaN  80000.0

In [17]:
#Dropping the rows having null values

s.dropna()

  Name Department   Salary
3  Sid   Spectrum  60000.0

In [18]:
s

      Name Department   Salary
0  Karthik        UIM      NaN
1    Omkar        NaN  18000.0
2   Piyush   Helpdesk      NaN
3      Sid   Spectrum  60000.0
4     Ajay        NaN  80000.0

In [20]:
#Replacing the null values with any value given by user

s['Salary'].fillna(60000,inplace=True)

In [21]:
s

      Name Department   Salary
0  Karthik        UIM  60000.0
1    Omkar        NaN  18000.0
2   Piyush   Helpdesk  60000.0
3      Sid   Spectrum  60000.0
4     Ajay        NaN  80000.0

In [32]:
s.fillna('Servicedesk')

      Name   Department   Salary
0  Karthik          UIM  60000.0
1    Omkar  Servicedesk  18000.0
2   Piyush     Helpdesk  60000.0
3      Sid     Spectrum  60000.0
4     Ajay  Servicedesk  80000.0

In [25]:
len(s)

5

In [26]:
s.count()

Name          5
Department    3
Salary        5
dtype: int64

In [37]:
s.fillna('Servicedesk',inplace=True)

In [38]:
s

      Name   Department   Salary
0  Karthik          UIM  60000.0
1    Omkar  Servicedesk  18000.0
2   Piyush     Helpdesk  60000.0
3      Sid     Spectrum  60000.0
4     Ajay  Servicedesk  80000.0

In [39]:
#Replacing values in a column

s['Department'].replace({'Servicedesk':'Service Desk'})

0             UIM
1    Service Desk
2        Helpdesk
3        Spectrum
4    Service Desk
Name: Department, dtype: object

In [40]:
s

      Name   Department   Salary
0  Karthik          UIM  60000.0
1    Omkar  Servicedesk  18000.0
2   Piyush     Helpdesk  60000.0
3      Sid     Spectrum  60000.0
4     Ajay  Servicedesk  80000.0

#### Cleaning Not Null Values

In [60]:
df = pd.DataFrame({
    'Sex': ['M', 'F', 'F', 'D', '?'],
    'Age': [29, 30, 24, 290, 25],
})

In [42]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [43]:
#Finding all unique values in a column

df['Sex'].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [57]:
#Replacing Wrong Value with the correct one

df=df['Age'],df['Sex'].replace({'D': 'F', '?': 'M'})

In [56]:
#Age has a wrong value inserted

df[df['Age'] > 100]

  Sex  Age
3   D  290

In [46]:
df.loc[df['Age'] > 100, 'Age'] = df.loc[df['Age'] > 100, 'Age'] / 10

In [61]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

### Duplicates

In [62]:
players = pd.DataFrame({
    'Name': [
        'Kobe Bryant',
        'LeBron James',
        'Kobe Bryant',
        'Carmelo Anthony',
        'Kobe Bryant',
    ],
    'Pos': [
        'SG',
        'SF',
        'SG',
        'SF',
        'SF'
    ]
})

In [63]:
players

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [64]:
#Displays True where Duplicate value is found

players.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [65]:
#Checks the duplicated value based on Name column

players.duplicated(subset=['Name'])

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [66]:
#Keeps the last value in the duplicates 

players.duplicated(subset=['Name'], keep='last')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [67]:
#Drop Duplicate Values

players.drop_duplicates()

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [68]:
players.drop_duplicates(subset=['Name'])

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
3  Carmelo Anthony  SF

In [69]:
players.drop_duplicates(subset=['Name'], keep='last')

              Name Pos
1     LeBron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

### Splitting Columns

In [92]:
df = pd.DataFrame({
    'Data': [
        '1987_M_US _1',
        '1990_M_UK_1',
        '1992_F_US_2',
        '1970_M_IT_1',
        '1985_F_IT_2'
]})

In [93]:
df

           Data
0  1987_M_US _1
1   1990_M_UK_1
2   1992_F_US_2
3   1970_M_IT_1
4   1985_F_IT_2

In [94]:
#Splits between value where delimeter is '-'

df['Data'].str.split('_')

0    [1987, M, US , 1]
1     [1990, M, UK, 1]
2     [1992, F, US, 2]
3     [1970, M, IT, 1]
4     [1985, F, IT, 2]
Name: Data, dtype: object

In [95]:
#Expands data based on split delimeter used

df=df['Data'].str.split('_', expand=True)

In [96]:
df.columns = ['Year', 'Sex', 'Country', 'No Children']

In [97]:
df

   Year Sex Country No Children
0  1987   M     US            1
1  1990   M      UK           1
2  1992   F      US           2
3  1970   M      IT           1
4  1985   F      IT           2